// Задача 34: Задайте массив заполненный 
// случайными положительными трёхзначными числами.
//  Напишите программу, которая покажет количество чётных чисел в массиве.

// [345, 897, 568, 234] -> 2

Console.Write("Введете количесво элементов в массиве: ");
int NumbersOfElements = Convert.ToInt32(Console.ReadLine());

int[] array = new int[NumbersOfElements];

for (int i = 0; i < array.Length; i++)
{

}
